package calc.swing;

public class Numerals { //массив римско-арабских чисел
        public static final String[][][] allNums = {{{"I","II","III","IV","V","VI","VII","VIII","IX"},	//римские единицы
                {"1","2","3","4","5","6","7","8","9"}},				                                //арабские единицы
                {{"X","XX","XXX","XL","L","LX","LXX","LXXX","XC"},	                                //римские десятки
                        {"1","2","3","4","5","6","7","8","9"}}, 			                        //арабские десятки
                {{"C","CC","CCC","CD","D","DC","DCC","DCCC","CM"},	                                //римские сотни
                        {"1","2","3","4","5","6","7","8","9"}}};			                        //арабские сотни
}
